Repository: LETARTARE/CodeDesigner
Catalog: src/trlocale/CodeDesigner.po
Languages: fr

source: Circle
fr: Cercle

source: Horizontal Tree
fr: Arbre Horizontal

source: Vertical Tree
fr: Arbre vertical

source: Mesh
fr: Maillage

source: Unable to initialize input stream.
fr: Impossible d'initialiser le flux d'entrée

source: Unknown file format.
fr: Format de fichier inconnu.

source: Unable to load XML file.
fr: Impossible de charger le fichier XML

source: Deserialization couldn't be completed because not of all shapes are accepted.
fr: La désérialisation n'est pas complète car certaines formes sont refusées

source: Shape canvas must be set in the wxSFPrintout class instance.
fr: Le canevas de la forme doit-être initialisé dans l'instance de 'wxSFPrintout'

source: Shape manager has not been properly set in shape canvas's constructor.
fr: Le gestionnaire de la forme n'a pas été correctement initialisé dans le constructeur du canevas de la forme.

source: Shape manager must be initialized before a creation of assigned canvas.
fr: Le gestionnaire de la forme doit être initialisé avant la création du canevas assigné.

source: Couldn't enable Graphics context due to missing wxUSE_GRAPHICS_CONTEXT
fr: Impossible de valider le contexte du graphique car il manque 'wxUSE_GRAPHICS_CONTEXT'

source: Couldn't change scale of shape canvas containing control (GUI) shapes.
fr: Impossible de modifier l'échelle du canevas de la forme contenant les formes des commandes (GUI)

source: The image has been saved to '%s'.
fr: L'image a été sauvegardée sous '%s'.

source: Unable to save image to
fr: Impossible de sauvegarder l'image vers

source: Could not create output bitmap.
fr: Impossible de créer la sortie 'bitmap'

source: There was a problem printing. Perhaps your current printer is not set correctly?
fr: L'impression a rencontré un problème. Votre imprimante n'est peut-être pas configurée correctement?

source: wxSF Printing
fr: Impression ' wxSF'

source: There was a problem previewing. Perhaps your current printer is not set correctly?
fr: La pré-visualisation a rencontré un problème. Votre imprimante n'est peut-être pas configurée correctement?

source: wxSF Previewing
fr: Aperçu 'wxSF'

source: wxSF Print Preview
fr: Aperçu avant impression

source: Unable to save XML document.
fr: Impossible de sauvegarder le document 'XML'

source: No matching file owner or version.
fr: Aucun propriétaire de fichier correspondant ou de version.

source: Properties dialog for '%s' isn't implemented yet.
fr: La boîte de dialogue des propriétés pour '%s' n'est pas encore mis en œuvre.

source: Link description...
fr: Description du lien...

source: Link properties
fr: Propriétés du lien

source: Diagram element link
fr: Lien de l'élément du diagramme

source: Copy Ctrl+C
fr: &Copier\tCtrl+C

source: Cut Ctrl+X
fr: Couper Ctrl+X

source: Edit properties...
fr: Editer les propriétés...

source: Edit diagram element
fr: Editer un élément du diagramme

source: Remove element
fr: Supprimer l'élément

source: Remove diagram element
fr: Supprimer l'élément du diagramme

source: Create
fr: Créer...

source: Navigate to element
fr: Accéder à l'élément

source: Scroll the diagram so the element will be in its center
fr: Déplacer le diagramme pour que l'élément soit au centre

source: Code item link
fr: Lien de l'élément de code

source: Edit action properties.
fr: Editer les propriétés de l'action

source: Remove code item
fr: Supprimer l'élément de code.

source: Remove code item.
fr: Supprimer l'élément de code.

source: Couldn't move item to its successor.
fr: Impossible de déplacer l'élément à son successeur.

source: Variable's description...
fr: Description de la variable

source: Function
fr: Fonction

source: Function's descritpion...
fr: Description de la fonction...

source: Diagram
fr: Diagramme

source: Diagram's description...
fr: Description du diagramme...

source: Show diagram
fr: Montrer le diagramme

source: Show diagram.
fr: Montrer le diagramme.

source: Code preview
fr: Prévisualisation du code

source: Store to bank
fr: Conserver dans la base

source: Edit diagram properties.
fr: Editer les propriétés du diagramme

source: Remove diagram
fr: Supprimer le diagramme

source: Remove diagram and all included items.
fr: Supprimer le diagramme et tous ses éléments

source: Diagram element
fr: Elément de diagramme

source: Diagram element's description...
fr: Description de l'élément du diagramme

source: Code items generator
fr: Générateur du code des éléments

source: ERROR: No valid generation target has been specified.
fr: ERREUR: Aucune cible valide à générer n'a été spécifiée

source: Initializing generator...
fr: Initialisation du générateur...

source: Initialization is done.
fr: L'initialisation est terminée...

source: ERROR: Initialization has failed.
fr: ERREUR: l'initialisation a échouée.

source: Starting code generation...
fr: Lancement de la génération du code...

source: Code generation is done.
fr: La génération du code est terminée.

source: Cleaning up the generator...
fr: Nettoyage du générateur...

source: Clean up process is done.
fr: Le nettoyage du processus est terminé.

source: Generation process is done.
fr: Le processus de génération est terminé.

source: Generation process is done with 'ERROR' status.
fr: La génération s'est terminée avec une ERREUR

source: Processing diagram '%s' ...
fr: Le '%s' est en cours de création ...

source: Preprocessing...
fr: Prétraitement en cours ...

source: Done.
fr: Terminé.

source: Verifying...
fr: Vérification.....

source: Verification is done with 'ERROR' status.
fr: La vérification s'est terminée par une 'ERREUR'

source: Verification is done with 'OK' status.
fr: La vérification s'est terminée correctement.

source: Optimizing...
fr: Optimisation...

source: Diagram '%s' was processed.
fr: Le diagramme '%s' à été traité.

source: - Undefined language -
fr: - Langage indéfini -

source: Base language class implementation.
fr: Mise en oeuvre du langage de base pour la classe.

source: Access type
fr: Type d'accès

source: Select access type to this class member:
fr: Sélectionner le type d'accès pour ce membre de classe:

source: Name cannot be empty.
fr: Le nom ne peut être vide.

source: <user-defined-code>
fr: <code personnalisé>

source: Parameter properties
fr: Propriétés du paramètre

source: Name (must be valid language identifier):
fr: Nom (doit-être valide pour le langage prévu)

source: Make valid
fr: Rendre valide

source: Generate code from this diagram
fr: Générer le code du diagramme

source: Advanced
fr: Avancé

source: Output file (without extension):
fr: Fichier de sortie (sans extension)

source: Select an output file
fr: Sélectionner le fichier de sortie

source: Reset
fr: Initialisation

source: Generator:
fr: Générateur:

source: Algorithm:
fr: Algorithme:

source: Generator
fr: Générateur

source: Link name:
fr: Nom du lien :

source: Original code item:
fr: Elément de code originel:

source: MyLabel
fr: Mon étiquette

source: Edit original
fr: Editer l'original

source: Call parameters
fr: Paramêtres de l'appel

source: Inline
fr: En ligne

source: Implementation:
fr: Implémentation:

source: Function modifier:
fr: Modificateur de la fonction :

source: Modifier:
fr: Modificateur:

source: Data type:
fr: Type de données:

source: Value type:
fr: Type de la valeur:

source: Return value
fr: Valeur de retour

source: Type name:
fr: Nom du type :

source: Defined in:
fr: Défini dans:

source: Built-in
fr: Intégré

source: Editor
fr: Editeur

source: Definition file
fr: Fichier de définition

source: Definition file:
fr: Fichier de définition :

source: Select a file
fr: Sélectionnez un fichier ...

source: User return type
fr: Type retour personnalisé

source: Add
fr: Ajouter

source: Edit
fr: Editer...

source: Remove
fr: Supprimer

source: Move up
fr: Monter

source: Move down
fr: Descendre

source: Parameters
fr: Paramètres

source: Function code
fr: Code de la fonction

source: User-defined return type
fr: Type du retour personnalisé

source: Default value:
fr: Valeur par défaut

source: User-define data type
fr: Type personnalisé

source: Comment
fr: Commentaire

source: Name (must be valid language identifier);
fr: Nom (doit-être valide pour le langage prévu)

source: Reference to '' has been found in:
fr: Référence à " ont été trouvés dans:

source: SelectAll
fr: Tout sélectionner

source: Deselect all
fr: Tout désélectionner

source: Pattern occurences:
fr: Occurences du motif:

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Cancel
fr: Annuler

source: Update selected
fr: Actualiser la sélection

source: Access:
fr: Accès:

source: Text
fr: Texte

source: Diagram properties
fr: Propriétés du diagramme

source: Code link properties
fr: Propriétés du lien du code

source: Function link properties
fr: Propriétés du lien de la fonction

source: Function properties
fr: Propriétés de la fonction

source: Variable properties
fr: Propriétés de la variable

source: Select a choice
fr: Faire un choix

source: Diagram element properties
fr: Propriétés de l'élément du diagramme

source: Update code references
fr: Mise à jour des références de code

source: Progress...
fr: Progression...

source: Reference to '
fr: Référence à '

source: ' has been found in these code items:
fr: ' a été trouvé dans les éléments de code

source: The end of the code preview has been reached.
fr: La fin de la prévisualisation du code est atteinte.

source: The begin of the code preview has been reached.
fr: Le début de la prévisualisation du code est atteinte.

source: Element
fr: Elément

source: Test action
fr: Test d'action

source: WARNING: '%s' element is not supported by this algorithm.
fr: ATTENTION : l'élément '%s' n'est pas supporté par cet algorithme.

source: Class function member with name '%s' doesn't exist in this scope yet. Would you like to create one?
fr: La fonction membre de la classe de nom « %s » n'existe pas encore dans cette portée. Souhaitez-vous en créer une ?

source: Function '%s' doesn't match the allowed form '%s'.
fr: La fonction '%s' ne correspond pas à la forme autorisée '%s'.

source: Class data member with name '%s' doesn't exist in this scope yet. Would you like to create one?
fr: La donnée membre nommée '%s' n'existe pas dans cette portée. Souhaitez-vous en créer une ?

source: Variable '%s' doesn't match the allowed form '%s'.
fr: La variable '%s' ne correspond pas à la forme autorisée '%s'.

source: Create constructor
fr: un constructeur

source: Create destructor
fr: un destructeur

source: Member variable
fr: une variable membre

source: Member function
fr: une fonction membre

source: Assign member variable
fr: Attribuer une variable membre

source: Assign member function
fr: Attribuer une fonction membre

source: Clear member variables
fr: Supprimer les variables membres

source: Clear member functions
fr: Supprimer les fonctions membres

source: The code link cannot be used in this scope.
fr: Le lien de code ne peut pas être utilisé dans cette portée.

source: Bind type '%s' doesn't match the allowed form '%s'.
fr: Le type lié '%s' ne correspond pas à la forme autorisée '%s'.

source: Add element
fr: Ajouter un élément

source: Clear all elements
fr: Effacer tous les éléments

source: Element '%s' doesn't match the allowed form '%s'.
fr: L'élément '%s' ne correspond pas à la forme autorisée '%s'.

source: Access
fr: Accès

source: Refactor virtual function
fr: Fonction virtuelle remaniée

source: Rename all correspoding ancestors/successors.
fr: Renommer tous les ancêtres et descendants correspondants.

source: Enumeration element:
fr: Elément d'énumération

source: Enter new enumeration element
fr: Entrez le nouvel élément de l'énumération

source: Given guard content doesn't match the allowed form '%s'.
fr: La garde fournie ne correspond pas à la forme autorisée '%s'

source: Condition with name '%s' doesn't exist yet. Would you like to create one?
fr: La condition nommée '%s' n'existe pas encore. Souhaitez-vous en créer une ?

source: Name '%s' doesn't match the allowed form '%s'.
fr: Le nom '%s' ne correspond pas à la forme autorisée '%s'.

source: Action with name '%s' doesn't exist yet. Would you like to create one?
fr: L'action nommée '%s' n'existe pas encore. Souhaitez-vous en créer une ?

source: Action list '%s' doesn't match the allowed form '%s'.
fr: L'action listée '%s' ne correspond pas à la forme autorisée '%s'.

source: Condition function
fr: Fonction de condition

source: Event flag
fr: Indicateur d'événement

source: Action function
fr: Fonction d'action

source: Assign condition/event
fr: Attribuer condition / événement

source: Assign action function
fr: Attribuer action / fonction

source: Clear condition/event
fr: Supprimer condition/évènement

source: Clear action functions
fr: Supprimer les fonctions d'action

source: Action with name '%s' doesn't exist yet. Would you like to create it?
fr: L'action nommée '%s' n'existe pas encore. Souhaitez-vous en créer une ?

source: State action '%s' doesn't match the allowed form '%s'.
fr: L'action d'état '%s' ne correspond pas à la forme autorisée '%s'.

source: UML diagrams
fr: Diagrammes UML

source: Set of UML diagrams.
fr: Ensemble de diagrammes UML

source: Simple state
fr: Etat de base

source: Sub machine
fr: Sous-système

source: Initial
fr: Etat initial

source: Final
fr: Etat final

source: Transition connection
fr: Connexion de transition

source: Composite machine
fr: Système composite

source: History
fr: Historique

source: Decision
fr: Choix

source: Class
fr: Classe

source: Class template
fr: Modèle de classe

source: Enumeration
fr: Énumération

source: Inheritance connection
fr: Connexion d'héritage:

source: Interface connection
fr: Connexion d'interface:

source: Bi-directional association
fr: Association bidirectionnelle

source: Uni-directional association
fr: Assocaition unidirectionnelle

source: Basic aggregation
fr: Agrégation

source: Composition aggregation
fr: Composition

source: Template binding
fr: Utilise modèle

source: Include association
fr: Utilisation

source: Transition element
fr: Element de transition

source: Composite state element
fr: Elément d'état composite

source: Sub diagram element
fr: Elément de sous-graphe

source: State chart sub diagram element
fr: Elément de sous-graphe d'état

source: Hierarchical state chart sub diagram element
fr: Elémentde hiérarchie de sous-graphe d'état

source: Simple state element
fr: Elément d'état de base

source: Initial state element
fr: Element d'état initial

source: Final state element
fr: Element d'état final

source: Decision state element
fr: Elément d'état décisionnel

source: History state element
fr: Elément d'état historique

source: Class element
fr: Element de classe

source: Enumeration element
fr: Elément d'énumération

source: Enumeration value
fr: Valeur d'énumération

source: Include association element
fr: Elément d'association d'inclusion

source: Class template element
fr: Elément de modèle de classe

source: Inheritance element
fr: Element d'héritage

source: Interface element
fr: Elément d'interface

source: Bi-directional association element
fr: Element d'association bidirectionnelle

source: Uni-directional association element
fr: Element d'assocaition unidirectionnelle

source: Basic aggregation element
fr: Element d'agrégation

source: Composition aggregation element
fr: Elément de composition

source: Class member data
fr: Attribut

source: Class member function
fr: Fonction membre de la classe...

source: Class constructor
fr: Constructeur de classe

source: Class destructor
fr: Destructeur de classe

source: Condition function link
fr: Lien de fonction de condition

source: Event flag link
fr: Lien d'indicateur d'évènement

source: Action function link
fr: Liaison fonction action

source: State action function link
fr: Lien de fonction d'action d'état

source: Element link
fr: Elément de liaison

source: Class member data link
fr: Lien d'attribut de la classe

source: Class member function link
fr: Lien de fonction membre de la classe

source: State chart sub diagram
fr: Elément de sous-graphe d'état

source: Simple State Chart diagram
fr: Graphe d'état simplifié

source: Hierarchical State Chart diagram
fr: Graphe d'état hiérarchique

source: Class diagram
fr: Diagramme de classe

source: False
fr: Faux

source: True
fr: Vrai

source: Entry action
fr: Action en entrée

source: Exit action
fr: Action en sortie

source: Normal event
fr: Evènement normal

source: Critical event
fr: Evènement critique

source: Action functions
fr: Fonctions d'action

source: Condition functions
fr: Fonctions de condition

source: Event flags
fr: Indicateurs d'évènement

source: Class data members
fr: Attributs

source: Class member functions
fr: Fonctions membres de la classe...

source: Constructors/destructors
fr: Constructeurs/Destructeurs

source: State action type
fr: Type d'action d'état

source: Function type
fr: Type de fonction :

source: Instance name cannot be empty.
fr: Le nom d'une instance ne doit pas être vide.

source: Inline code
fr: Code en ligne

source: Event type:
fr: Type d'évènement:

source: Clear event flag
fr: Supprimer évènement//indicateur

source: Clear event flag automatically
fr: Supprimer l'indicateur d'évènement automatiquement

source: Condition:
fr: Condition de garde:

source: Priority:
fr: Priorité :

source: Used actions:
fr: Actions utilisées

source: Select all
fr: Tout sélectionner

source: Remove all
fr: Tout supprimer

source: Up
fr: Haut

source: Down
fr: Bas

source: Available actions:
fr: Actions disponibles

source: Return value:
fr: Valeur de retour:

source: Default
fr: Par défaut

source: Entry
fr: Entrée

source: Exit
fr: Sortie

source: Call parameters for base constructor:
fr: Paramêtres pour l'appel du constructeur de base.

source: Base classes
fr: Classes de base

source: New name (must be valid identifier):
fr: Nouveau nom (doit-être un identificateur valide)

source: Rename also:
fr: Renommer aussi:

source: Typename:
fr: Nom du type:

source: Template
fr: Modèle

source: Instance name:
fr: Nom de l'instance :

source: Parameters:
fr: Paramètres:

source: Static
fr: Statique

source: Dynamic
fr: Dynamique

source: Value:
fr: Valeur:

source: Generate code
fr: Générer le code

source: Store return value
fr: Conserver la valeur de retour.

source: Store value returned from managed sub diagram
fr: Conserver la valeur retournée depuis le sous-graphe utilisé

source: Include target class
fr: Inclure la classe cible

source: Condition/Action properties
fr: Propriétés de la condition d'action

source: State action properties
fr: Propriétés de l'action d'état

source: Event properties
fr: Propriétés de l'événement

source: State action link properties
fr: Propriétés du lien de l'action d'état

source: Class member link properties
fr: Propriétés du lien du membre de classe

source: Event link properties
fr: Propriétés du lien de l'événement

source: Transition properties
fr: Propriétés de la transition

source: Final state properties
fr: Propriétés de l'état final

source: Composite state properties
fr: Propriétés de l'état composite

source: Constructor properties
fr: Propriétés du constructeur

source: Destructor properties
fr: Propriétés du destructeur

source: Class template properties
fr: Propriétés du modèle de classe

source: Enumeration element properties
fr: Propriétés de élément de l'énumération

source: Enumeration properties
fr: Propriétés de l'énumération

source: Class properties
fr: Propriétés de la classe

source: Sub machine properties
fr: Propriétés du sous-système

source: Aggregation properties
fr: Propriétés de l'agrégation

source: State Chart diagram properties
fr: Propriétés du graphe d'état

source: Non-blocking state chart
fr: Graphe d'état non bloquant

source: Input action:
fr: Action d'entrée:

source: '%s' is not accepted by '%s'
fr: '%s' n'est pas accepté par '%s'

source: Selected language doesn't support class instantiation.
fr: Le langage choisi ne supporte pas l'instanciation de classe

source: Only final states from source sub machine can be dropped here.
fr: Seuls les états finaux d'un sous-sytème peuvent être déposés ici.

source: >>> Iteration %d ...
fr: >>> Itération %d....

source: ERROR: there is no initial state in diagram '%s'.
fr: ERREUR: le graphe '%s' n'a pas d'état initial.

source: ERROR: more than one initial state in a parent object (state: '%s')
fr: ERREUR: plus d'un état initial dans l'objet parent (état: '%s')

source: WARNING: there should be at least one ending state in diagram '%s'.
fr: ATTENTION: il devrait exister au moins un état terminal dans le graphe '%s'.

source: ERROR: there is unconnected state '%s' in diagram '%s'.
fr: ERREUR: il existe un état '%s' non relié dans le graphe '%s'.

source: ERROR: there are tansitions with duplicated guard condition in state '%s'.
fr: ERREUR: il existent des transitions avec des gardes dupliquées dans l'état '%s'.

source: ERROR: there are tansitions with duplicated priority level in state '%s'.
fr: ERREUR: il existent des transitions avec des niveaux de priorité dupliqués dans l'état '%s'.

source: ERROR: there are more than one conditionless transitions in state '%s'.
fr: ERREUR: il ya plus de transitions que de conditions dans l'état '%s'.

source: ERROR: history state '%s' has no parent.
fr: ERREUR: l'état historique '%s' n'a pas de parent.

source: ERROR: there must by exactly one conditionless incoming transition in history state '%s' which starts either in an initial state or in parent composite state.
fr: ERREUR: il doit y avoir exactement une condition entrante de moins que les transitions dans l'historique d'état '%s' qui commence soit dans l'état initial soit dans un état composite du parent.

source: ERROR: there must by exactly one conditionless outcoming transition in history state '%s'.
fr: ERREUR: il doit y avoir exactement une condition sortant de moins que les transitions dans l'historique d'état '%s'.

source: ERROR: 'GOTO' code generation algorithm set in diagram '%s' doesn't support input actions.
fr: ERREUR: l'algorithme de génération de code 'GOTO' du graphe '%s' ne permet pas les actions en entrée.

source: ERROR: 'GOTO' code generation algorithm set in diagram '%s' doesn't support non-blocking state charts.
fr: ERREUR: l'algorithme de génération de code 'GOTO' du diagramme '%s' ne permet pas les graphes d'état non bloquants.

source: CodeLite plugin: IPC connection on port %s estabilished.
fr: La connexion 'IPC' de l'extension 'CodeLite' sur le port %s est établie

source: WARNING: CodeLite plugin: IPC connection on port %s failed.
fr: ATTENTION: La connexion IPC de l'extension 'CodeLite' sur le port %s a échouée.

source: Reverse Engineering
fr: Rétroingénierie

source: Reverse code engineering plugin which uses CTAGS tool to parse source files.
fr: Extension de rétroingénierie du code qui utilise l'outil 'CTAGS' pour analyser les fichiers sources.

source: Choose source files:
fr: Choisissez les fichiers source:

source: Add files
fr: Ajouter des fichiers

source: Remove selected
fr: Supprimer la sélection

source: Files to be parsed by CTAGS.
fr: Fichiers à analyser par 'CTAGS'.

source: Remove selected files
fr: Supprimer les fichiers sélectionnés

source: Remove all files
fr: Supprimer tous les fichiers

source: Check all
fr: Vérifier tout

source: Uncheck all
fr: Décocher tout

source: Identifiers:
fr: Identificateurs :

source: Specifies a list of identifiers which are to be specially handled by CTAGS while parsing C and C++ source files.
fr: Indique une liste d'identificateurs qui doivent être spécialement traitées par 'CTAGS' lors de l'analyse des fichiers source C et C++..

source: Parse checked files
fr: Analyser les fichiers cochés

source: Found symbols:
fr: Symboles trouvés:

source: Expand/Collapse All
fr: Tout étendre/réduire
