Repository: LETARTARE/CodeDesigner
Catalog: src/trlocale/CodeDesigner.po
Languages: fr

source: Expand/collapse all tree items
fr: Etendre/réduire tous les éléments de l'arborescence

source: Import symbols
fr: Importer des symboles

source: Import selected symbols
fr: Importer les symboles sélectionnés

source: Members
fr: Membres

source: Import class members
fr: Importer les membres de classe

source: Bodies
fr: Corps

source: Import function bodies
fr: Importer le corps des fonctions

source: Remove all symbols
fr: Supprimer tous les symboles

source: Choose source files
fr: Choisissez les fichiers source:

source: Source files (*.*)|*.*
fr: Fichiers source (*.*)|*.*

source: ERROR: Unable to determine programing language from source files. Known file extensions are:
fr: ERREUR: Impossible de déterminer le langage de programmation depuis les fichiers source. Les extensions connues sont:

source: . List of known file extensions can be changed via Reverse Engineering plugin settings.
fr: . La liste des extensions de fichiers connus peut être modifiée via les paramètres de l'extension de Rétroingénierie.

source: Moreover, just one programming language can be used at the time.
fr: En outre, un seul langage de programmation peut être utilisé à la fois.

source: Unable to determine programing language from source files. See the log window for more details.
fr: Impossible de déterminer le langage de programmation à partir des fichiers source. Voir la fenêtre des rapports pour plus de détails.

source: CTAGS utility failed. Please see the log window for more details.
fr: Échec de l'utilitaire 'CTAGS'. S'il vous plaît voir la fenêtre des rapports pour plus de détails.

source: ERROR: Unable to find CTAGS under path
fr: ERREUR : Impossible de trouver 'CTAGS' depuis le chemin d'accès

source: ERROR: Please, specify correct path to CTAGS utility in Reverse Engineering plugin's settings
fr: ERREUR : Veuillez préciser le chemin d'accès correct de l'utilitaire 'CTAG'S dans les paramètres de l'extension de Rétroingénierie

source: ERROR: CTAGS failed with return value %d.
fr: ERREUR : Echec de 'CTAGS' avec une valeur renvoyée %d.

source: Parsing classes...
fr: Analyse des classes

source: Parsing classes... %s
fr: Analyse des classes... %s

source: Parsing enums...
fr: Analyse des énumérations...

source: Parsing enums... %s
fr: Analyse des énumérations... %s

source: Parsing global functions...
fr: Analyse des fonctions globales...

source: Parsing global functions... %s
fr: Analyse des fonctions globales... %s

source: Parsing global variables...
fr: Analyse des variables globales...

source: Parsing global variables... %s
fr: Analyse des variables globales... %s

source: Starting reverse code engineering...
fr: Lancement de la rétroingénierie du code...

source: Importing classes...
fr: Importer des classes

source: Importing enums...
fr: Importer des énumérations...

source: Importing functions...
fr: Importation des fonctions...

source: Importing variables...
fr: Importer des variables

source: Updating project...
fr: Mise à jour du projet...

source: Select symbols to be processed.
fr: Sélectionner les symboles à analyser

source: Number of symbols: %d
fr: Nombre de symboles: %d

source: WARNING: Manual check of parsed project items is strongly recommended due to possible simplifications done during the import process.
fr: ATTENTION: Une vérification manuelle des éléments du projet est fortement recommandée car une simplification est réalisée lors du processus d'importation.

source: Original class member: "
fr: Membre de la classe origine: "

source: Original parameter: "
fr: Paramètre originel: "

source: Original function: "
fr: Fonction originelle: "

source: Original variable: "
fr: Variable originelle: "

source: Reusable code fragments
fr: Constituants réutilisables

source: Diagram record's description...
fr: Description du dossier du diagramme

source: Common
fr: Commun

source: Time
fr: Date

source: Clear
fr: Effacer

source: ERROR
fr: ERREUR

source: WARNING
fr: ATTENTION

source: ERROR: Unable to load plugin:
fr: ERREUR: Impossible de charger l'extension:

source: WARNING: Couldn't initialize'
fr: ATTENTION: Initialisation impossible de l'extension '

source: WARNING: Couldn't uninitialize'
fr: ATTENTION: désinitialisation impossible de l'extension '

source: ' plugin correctly.
fr: ' correctement.

source: Project items
fr: Eléments du projet

source: Create diagram package
fr: Créer un paquetage de diagrammes

source: Create new package and add it to the project root
fr: Créer un nouveau paquetage et l'ajouter dans la racine du projet

source: Create code package
fr: Créer un paquetage

source: Create new code package and add it to the project root
fr: Créer un nouveau paquetage de code et l'ajouter dans la racine du projet

source: Package
fr: Paquetage

source: Create
fr: Créer un

source: Create new
fr: Créer un nouveau

source: and add it to the current package.
fr: et l'ajouter au paquetage courant

source: Insert diagram from bank
fr: Insérer un diagramme depuis la base

source: Remove package
fr: Supprimer le paquetage

source: Remove package and all included items.
fr: Supprimer le paquetage et tous ses éléments

source: Create new code package
fr: Créer un nouveau paquetage de code

source: Create generic variable
fr: Créer une variable générique

source: Create new user-defined variable
fr: Créer une nouvelle variable personnalisée

source: Create generic function
fr: Créer une fonction générique

source: Create new user-defined function
fr: Créer une fonction personnalisée

source: Remove all user-defined code items.
fr: Supprimer tous les éléments personnalisés

source: Properties
fr: Propriétés

source: CDCode
fr: FICBASE

source: CDCode_CI
fr: FICBASE_ELEM

source: This language is not supported by the system.
fr: Ce langage n'est pas supporté par le système.

source: CodeDesigner's usage: CodeDesigner [-g][project] g - generate opened project immediately project - path to a project file to be opened by CodeDesigner
fr: Utilisation de 'CodeDesigner' : CodeDesigner [-g][projct] g - génère de suite le projet ouvert project - chemin du fichier projet ouvert par 'CodeDesigner'

source: Application settings couldn't be read so default values will be used.
fr: La configuration de l'application est illisible, aussi les valeurs par défaut seront utilisées

source: Diagram bank file couldn't be read correctly (probably some previously used plugins aren't loaded at this time) so the current file was archived and new one is in use.
fr: Le fichier de la base est illisible (probablement des extensions utiles ne sont pas chargées) aussi le fichier actuel est archivé et un nouveau est utilisé

source: Group
fr: Groupement

source: Note connection
fr: Note sur connexion :

source: Project manager
fr: Gestionnaire de projets

source: Log window
fr: Fenètre des rapports

source: Thumbnail
fr: Loupe

source: Code editor
fr: Editeur de code

source: File toolbar
fr: Barre d'outils des fichiers

source: Diagram toolbar
fr: Barre d'outils des diagrammes

source: Layout toolbar
fr: Barre d'outils de positionnement

source: Generator toolbar
fr: Barre d'outils des générateurs

source: Code items
fr: Constituants

source: Generic variables
fr: Variables génériques

source: Generic functions
fr: Fonctions génériques

source: Design area
fr: Espace de conception

source: Project inspector
fr: Inspecteur de projet

source: Ready
fr: Prêt

source: Undo Ctrl+Z
fr: Défaire Ctrl+Z

source: Redo Ctrl+Y
fr: Refaire Ctrl+Shift+Z

source: Paste Ctrl+V
fr: Coller/Ctrl+V

source: Zoom to all
fr: Zoom tout

source: New
fr: Nouveau

source: New project
fr: Nouveau projet

source: Load
fr: Charger

source: Open project...
fr: Ouvrir un projet ...

source: Save
fr: Sauvegarder

source: Save project
fr: Sauvegarder le projet

source: Save as...
fr: Sauvegarder sous...

source: Save project as...
fr: Sauvegarder un projet sous...

source: Print
fr: Imprimer

source: Print active diagram...
fr: Imprimer le diagramme actif

source: Preview
fr: Prévisualisation

source: Preview active diagram...
fr: Aperçu du diagramme actif...

source: Copy
fr: Copier

source: Copy to clipboard
fr: Copier vers le presse-papiers

source: Cut
fr: Couper

source: Cut to clipboard
fr: Couper vers le presse-papier

source: Paste
fr: Coller

source: Paste from clipboard
fr: Coller le texte depuis le presse-papiers

source: Undo
fr: Défaire

source: Redo
fr: Refaire

source: Create new package
fr: Création d'un nouveau paquetage

source: Code package
fr: Paquetage de code

source: Create user-defined generic variable
fr: Créer une variable générique personnalisée

source: Create user-defined generic function
fr: Créer une fonction générique personnalisée

source: Project settings
fr: Configuration du projet

source: Grid
fr: Grille

source: Show/hide grid
fr: Afficher/Masquer la grille

source: Align left
fr: Aligner à gauche

source: Align selected items to the left
fr: Aligner les éléments sélectionnés à gauche

source: Align right
fr: Aligner à droite

source: Align selected items to the right
fr: Aligner les éléments séléctionnés à droite

source: Align top
fr: Aligner en haut

source: Align selected items to the top
fr: Aligner les éléments séléctionnés vers le haut

source: Align bottom
fr: Aligner en bas

source: Align selected items to the bottom
fr: Aligner les éléments sélectionnés vers le bas

source: Align center
fr: Aligner au centre

source: Align selected items to the center
fr: Aligner les éléments séléctionnés au centre

source: Align middle
fr: Aligner au milieu

source: Align selected items to the middle
fr: Aligner les éléments séléctionnés au milieu

source: Align into circle
fr: Aligner sur un cercle

source: Align selected items into circle
fr: Aligner les éléments séléctionnés dans un cercle

source: Align into mesh
fr: Aligner sur le maillage

source: Align selected items into mesh
fr: Aligner les éléments séléctionnés sur le maillage

source: Align into vertical tree
fr: Aligner verticalement

source: Align selected items into vertical tree
fr: Aligner les éléments sélectionnés dans l'arbre verticalement

source: Align into horizontal tree
fr: Aligner horizontalement

source: Align selected items into horizontal tree
fr: Aligner les éléments sélectionnés dans l'arbre horizontalement

source: Generate code preview for an active chart
fr: Aperçu du code pour le grahe actif

source: Generate
fr: Générer

source: Generate code for an active project
fr: Générer le code du projet actif

source: Select output programming language
fr: Choix du langage de sortie.

source: Select generator
fr: Sélectionner un générateur

source: Select algorithm
fr: Choix de l'algorithme

source: Design tool
fr: Outil conception

source: DEBUG: Event type: %d, item: %s, parent: %s
fr: DEBUG : Type d'événement: %d, élément: %s, parent : %s

source: Couldn't add '%s' item to this diagram
fr: Impossible d'ajouter l'élément '%s' à ce diagramme

source: Element '%s' is linked by other elements. Do you realy want to remove it?
fr: Cet élémént '%s' esr lié à d'autres éléments.Voulez-vous le supprimer malgré tout ?

source: Element '%s' is referenced by code items: %sDo you realy want to remove the element?
fr: L'élément '%s' est référencié par d'autres éléments: %sVoulez-vous le suprimer malgré tout ?

source: Modified
fr: Modifié

source: Saved
fr: Sauvegardé

source: Unable to load the project file due to unsupported diagram types.
fr: Le fichier du projet ne peut être chargé car il comporte des types de diagrammes non supportés

source: CodeDesigner project (*.cdp)|*.cdp
fr: Projets de 'CodeDesigner' (*.cdp)|*.cdp

source: Current unsaved changes will be lost. Would you like to load the project anyway?
fr: Les modifications courantes non enregistrées seront perdues. Souhaitez-vous charger le projet quand même ?

source: Save project...
fr: Sauvegarder le projet

source: Export diagram to image...
fr: Exporter l'image du diagramme

source: BMP Files (*.bmp)|*.bmp|GIF Files (*.gif)|(*.gif)|XPM Files (*.xpm)|*.xpm|PNG Files (*.png)|*.png|JPEG Files (*.jpg)|*.jpg|SVG Files (*.svg)|*.svg
fr: Fichier BMP (*.bmp)|*.bmp|Fichiers GIF (*.gif)|(*.gif)|Fichiers XPM (*.xpm)|*.xpm|Fichiers PNG (*.png)|*.png|Fichiers JPEG (*.jpg)|*.jpg|Fichiers SVG (*.svg)|*.svg

source: Project is changed. Do you want to save it?
fr: Le projet a été modifié. Voulez-vous le sauvegarder ?

source: Application preferences
fr: Préférences de l'application

source: Cross-platform CASE tool designed for drawing of UML diagrams, code generation and reverse code engineering.
fr: Outil de génie logiciel pour plates-formes croisées orienté UML : diagrammes, génération de code ainsi que rétroconception

source: Available diagrams:
fr: Diagrammes disponibles

source: Available generators:
fr: Générateurs disponibles :

source: Current tool: Design tool
fr: Outil actuel : Conception

source: Current tool: %s
fr: Outil actuel: %s

source: Are you sure you want to remove all project items?
fr: Êtes-vous sûr de vouloir supprimer tous les éléments du projet ?

source: Are you sure you want to remove '%s' from the project?
fr: Êtes-vous sûr de que vouloir supprimer '%s' du projet ?

source: Generation process finished with ERROR status. See the log window for more details.
fr: La génération s'est terminée avec une ERREUR. Voir la fenètre des rapports pour plus d'informations

source: Unable to initialize output stream.
fr: Impossible d'initialiser le flux de sortie

source: Unable to create selected code generator.
fr: Impossible de créer le générateur de code sélectionné

source: Code generation process has been aborted because some user-defined code items' content located in generated files is ambiguous. Please see the log window for more details.
fr: La génération du code s'est arrétée car un élément de code défini par l'utilisateur est ambigü. Consulté le journal des rapports pour plus d'informations

source: Code generation process has been aborted by the user.
fr: La génération du code a été arrétée par l'utilisateur.

source: Code generation process has been aborted because some user-defined code items' content placed in generated files is ambiguous. Please see the log window for more details.
fr: La génération du code s'est arrétée car un élément de code défini par l'utilisateur est ambigu. Consulté le journal des rapports pour plus d'informations

source: Unable to create the project generator for selected language.
fr: Impossible de créer le générateur du projet pour le langage spécifié

source: Unable to retrieve selected language processor.
fr: Impossible de récupérer le processeur du langage sélectionné.

source: Some diagrams couldn't be inserted into the projet. Please, see the log for more details.
fr: Quelques diagrammes n'ont pu être insérés dans le projet. S.V.P, consulter la fenètre de rapport pour plus d'informations

source: Diagram '%s' was stored into bank.
fr: Le diagramme '%s' est conservé dans la base

source: Export diagram bank...
fr: Exporter la base de diagramme...

source: Diagram bank (*.cdbank)|*.cdbank|All files (*.*)|*.*
fr: Base de diagramme (*.cdbankk)|*.cdbank|All files (*.*)|*.*

source: Diagram bank has been exported to '
fr: La base de diagramme a été exportée vers '

source: Unable to export diagram bank to '
fr: Impossible d'exporter la base de diagramme vers '

source: Import diagram bank...
fr: Importer la base de diagramme...

source: Imported data has been merged with current diagram bank content.
fr: Les données importées ont été fusionnées avec le contenu de la base de diagramme actuelle

source: Diagram bank file couldn't be read correctly (probably some previously used plugins aren't loaded at this time).
fr: La base de diagramme est illisible (probablement des extensions utiles ne sont pas chargées)

source: Are you sure you want to reset current layout?
fr: Êtes vous sûr de vouloir nettoyer les tracés actuels

source: The change will take an effect after application's restart
fr: Vous devez redémarrer l'application pour que ces changements prennent effet.

source: There is nothing to update.
fr: Il n'y a rien à actualiser

source: Some code items have been updated. Please, see the log window.
fr: Quelques éléments de code ont été actualisés. S.V.P, consulter la fenètre des rapports pour plus d'informations

source: Some code items couldn't be updated due to their ambiguous instances. Please, see the log window.
fr: Quelques éléments de code n'ont pu être actualisés, car leurs instances sontt ambigues. S.V.P, consulter la fenètre des rapports pour plus d'informations

source: Output directory '
fr: Le répertoire de sortie '

source: ' doesn't exist. Please check the project settings.
fr: ' n'existe pas. Veuillez vérifier les paramètres du projet.

source: Generating '%s'...
fr: Génération de '%s'...

source: Generating code for diagram '%s'...
fr: Génération du code pour le diagramme '%s'...

source: Output files: %s, %s.
fr: Fichier de sortie: %s, %s.

source: Output file: %s.
fr: Fichier de sortie: %s.

source: Unable to generate project code.
fr: Impossible de générer le code du projet.

source: ERROR: Code generation algorithm used in '%s' diagram doesn't support selected programming language.
fr: ERREUR: L'algorithme de génération du code utilisé dans le diagramme '%s' ne supporte pas le langage choisi.

source: WARNING: Instances of '%s::%s' generated code are ambiguous.
fr: ATTENTION: Les instances générées pour '%s::%s' sont ambigües

source: Code item '%s::%s' is identical.
fr: L'élément de code '%s::%s' est identique

source: Name
fr: Nom

source: Code item:
fr: Constituant:

source: <no editable content>
fr: <contenu non éditable>

source: Code item: <none>
fr: Code de l'élément: <aucun>

source: &New project
fr: &Nouveau projet

source: &Open project...
fr: &Ouvrir un projet ...

source: &Save project as...
fr: &Sauvegarder le projet sous ...

source: Export active diagram to BMP file
fr: Exporter le diagramme actif vers un fichier image 'BMP'

source: &Print...
fr: &Imprimer...

source: Print active diagram
fr: Imprimer le diagramme actif

source: Preview...
fr: &Aperçu

source: Preview active diagram
fr: Aperçu du diagramme actif

source: Page setup...
fr: Mise en page...

source: Set page properties
fr: Page de propriétés

source: Recent projects
fr: Projets récents

source: &Quit
fr: &Quitter

source: Quit the application
fr: Quitter l'application

source: &File
fr: &Fichier

source: &Undo
fr: &Défaire

source: &Redo
fr: &Refaire

source: &Copy
fr: &Copier

source: &Paste
fr: Co&ller

source: Select &all
fr: Sélectionner &tout

source: Select all items in current diagram
fr: Sélectionner tpus les éléments de ce diagramme

source: Preferences...
fr: Préférences...

source: &Edit
fr: &Edition

source: Reset layout
fr: Disposition initiale

source: &View
fr: &Visuels

source: Create user-defined variable
fr: Créer une variable personnalisée

source: Create user-defined function
fr: Créer une fonction personnalisée

source: Edit selected item
fr: Editer l'élément sélectionné

source: Edit properties of seleceted project item
fr: Editer les propriétés de l'élement séléctionné du projet

source: Remove selected item
fr: Supprimer l'élément sélectionné

source: Remove item selected in the project view from current project
fr: Supprime l'élément sélectionné dans la vue du projet courant

source: Clear project (permanently remove all project items)
fr: Nettoyer le projet (supprime définitivement tous les éléments)

source: Settings...
fr: Paramètres...

source: &Project
fr: &Projet

source: Manage bank...
fr: Gérer la base...

source: Store diagram to bank
fr: Conserver le diagramme dans la base

source: Store currently selected diagram to bank
fr: Le diagramme sélectionné est conservé dans la base

source: Insert diagram from bank to currently selected package
fr: Insérer un diagramme de la base dans le paquetage sélectionné

source: Import bank...
fr: Importer la base

source: Export bank...
fr: Exporter la base...

source: &Diagram bank
fr: Base de &Diagramme

source: &Preview
fr: &Aperçu

source: Generate code from active diagram
fr: Générer le code du diagramme actif

source: &Generate
fr: &Générer

source: Generate code for an active chart
fr: Générer le code du graphe actif

source: Synchronize code
fr: Synchoniser le code

source: Synchronize changes in code items' source code.
fr: Synchroniser les changements des éléments et le code source

source: &Code generation
fr: Génération du &Code

source: Manage plugins...
fr: Gestion des extensions...

source: Manage available plugins
fr: Gestion des extensions disponibles

source: &Plugins
fr: &Extensions

source: &About...
fr: À &propos...

source: Show info about this application
fr: Affiche les informations à propos de cette application

source: &Help
fr: &Aide

source: Zoom diagram to its original size
fr: Montrer le diagramme à sa taille originelle.

source: Zoom diagram to fit the design area
fr: Zoom du diagramme sur ll'espace de conception

source: Design area zoom
fr: Zoom de l'espace de conception

source: Close
fr: Fermer

source: Close editor window
fr: Fermer l'éditeur

source: Cu&t
fr: C&ouper

source: Link on/off
fr: (Dé)Activer le lien

source: Link project manager with design area
fr: Lier le gestionnaire de projet avec la zone de conception

source: Expand/Collapse all
fr: Tout étendre/réduire

source: Show properies
fr: Afficher les propriétés

source: Inspect properties of selected tree item
fr: Inspecter les propriétés de l'élément sélectionné dans l'arbre

source: Organize code items
fr: Organiser les éléments de code

source: Save changes (Alt+S)
fr: Sauvegarder les modifications (Alt+S)

source: Code item:
fr: Code de l'élément

source: Defaults
fr: Défauts

source: Category:
fr: Catégorie:

source: Selec all
fr: Tout sélectionner

source: Show info
fr: Afficher les informations

source: Insert selected
fr: Insérer la sélection

source: Diagram info
fr: Information sur le diagramme

source: Dependencies:
fr: Dépendances:

source: Used code items:
fr: Les éléments de code utilisés

source: Categories
fr: Catégories

source: Create new category
fr: Créer une nouvelle catégorie

source: Rename
fr: Renommer

source: Remove selected categories
fr: Supprimer les catégories sélectionnées

source: Diagrams
fr: Diagrammes

source: Remove selected diagrams
fr: Supprimer les diagrammes sélectionnés

source: Copy to...
fr: Copier vers...

source: Copy dialog to another category
fr: Copier le dialogue vers une autre catégorie

source: Move to...
fr: Déplacer vers...

source: Move to another category
fr: Déplacer vers une autre atégorie

source: Available plugins:
fr: Extensions disponibles

source: Select code items which should be updated:
fr: Sélectionner les éléments de code que vous désirez actualiser

source: In generated files:
fr: Dans les fichiers générés:

source: In CodeDesigner:
fr: Dans 'CodeDesigner'

source: Group color:
fr: Groupe de couleur

source: Settings
fr: Paramètres

source: Select diagrams for insertion
fr: Sélectionnez les diagrammes pour l'insertion

source: Diagram Info
fr: Information sur le diagramme

source: Manage diagram bank
fr: Gérer la base de diagramme

source: Manage plugins
fr: Gestion des extensions

source: Group element properties
fr: Propriétés du groupement d'éléments

source: Selected category is not empty. Are you sure you want to remove it?
fr: La catégorie sélectionnée n'est pas vide. Êtes-vous sûr de vouloir la supprimer ?

source: Are you sure you want to remove selected diagram?
fr: Êtes-vous sûr de vouloir supprimer le diagramme sélectionné ?

source: Are you sure you want to remove all diagrams from this category?
fr: Êtes-vous sûr de vouloir supprimer tous les diagrammes de cette catégorie ?

source: Move diagram
fr: Déplacer le diagramme

source: Select target category:
fr: Sélectionnez la catégorie cible :
