Repository: LETARTARE/CodeDesigner
Catalog: src/trlocale/CodeDesigner.po
Languages: fr

source: All changes will take an effect after application's restart.
fr: Vous devez redémarrer l'application pour que ces changements prennent effet.

source: Plugin info
fr: Info sur extension

source: Author
fr: Auteur

source: Are you sure you want to set all properties to default values?
fr: Êtes-vous sûr de vouloir supprimer tous les éléments du projet ?

source: Name:
fr: Nom :

source: Category name:
fr: Nom de catégorie :

source: User-defined code of '%s::%s' has been updated.
fr: Le code personnalisé de '%s::%s' a été actualisé.
